Белгипрозем_2017/src/InformationRegisters/ПравилаПересылкиСообщений/ПравилаПересылкиСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаПересылкиСообщений</name>
  <resources>
    <name>ТранспортОтправки</name>
    <type>
      <types>CatalogRef.ТранспортыОтправкиСообщенийСВД</types>
    </type>
  </resources>
  <dimensions>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/СерверныеСообщенияСВД/СерверныеСообщенияСВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверныеСообщенияСВД</name>
  <attributes>
    <name>ДатаОтправкиПолучателю</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияСервером</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтКого</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСообщения</name>
    <type>
      <types>CatalogRef.ФорматыСообщенийСВД</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/ОтправкаПолучениеСообщенийСерверСВД/Module.bsl
Процедура ПриемСообщенийСерверомСВД() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортыПриемаСообщенийСВД.Ссылка
		|ИЗ
		|	Справочник.ТранспортыПриемаСообщенийСВД КАК ТранспортыПриемаСообщенийСВД
		|ГДЕ
		|	ТранспортыПриемаСообщенийСВД.Активен = ИСТИНА";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТранспортСсылка = Выборка.Ссылка;
			МенеджерТранспорта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ТранспортСсылка);
			МенеджерТранспорта.Получитьсообщения(ТранспортСсылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПересылкаСообщенийСерверомСВД() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	//МиСофт+
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерверныеСообщенияСВД.Ссылка,
		|	ПравилаПересылкиСообщений.ТранспортОтправки
		|ИЗ
		|	Справочник.СерверныеСообщенияСВД КАК СерверныеСообщенияСВД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПересылкиСообщений КАК ПравилаПересылкиСообщений
		|		ПО СерверныеСообщенияСВД.Кому = ПравилаПересылкиСообщений.Корреспондент
		|ГДЕ
		|	СерверныеСообщенияСВД.Отправлено = ЛОЖЬ
		|	И СерверныеСообщенияСВД.ПометкаУдаления = ЛОЖЬ";
	//МиСофт-
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерТранспорта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Выборка.ТранспортОтправки);
			МенеджерТранспорта.ОтправитьСообщение(Выборка.ТранспортОтправки, Выборка.ссылка);
			
			СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СообщениеОбъект.Отправлено = Истина;
			СообщениеОбъект.ДатаОтправкиПолучателю = ТекущаяДатаСеанса();
			СообщениеОбъект.Записать();
						
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
